<?php
/**
 * 2. Написать функцию, которая будет принимать 2 параметра. Первый параметр это процент (число).
 * Второй параметр этомассив чисел (числа могут быть как целые так и дробные).
 * Задача функции - увеличить каждый четный элемент массивана процент,
 * а каждый не четный элемент массива уменьшить на заданный процент.
 * p.s. напоминаю, для того чтобы узнать четный элемент массива или не четный вам необходимо применить оператор остатокот
 * деления (%) и переменную индекса массива
 *
 *
 * Теперь по поводу дополнительных материалов по MySQL/SQL.
 * У нас к сожалению не будет времени на подробное изучение SQL,
 * если вы не планируете идти на отдельный курс по базам данным то вот немного материалов:
 * 1. Вот тут ряд уроков, очень доступно рассказывают
 * https://www.youtube.com/playlist?list=PLDywto_IU4_4RU0sKfID6OY-np6uGmhlf2.
 * Вот тут много упражнений по SQL.www.sql-ex.ru (нужно зарегистрироваться)
 * Сайт очень старый, но задачи очень актуальные
 * 3. Вот хорошее видео про нормализацию базы данных
 * https://www.youtube.com/watch?v=gDDrpL75LJY
 */